/* 
  Controls.strings
  Simple RSS Viewer

  Created by Gleb Gorelov on 24.09.14.
  Copyright (c) 2014 Gleb Gorelov. All rights reserved.
*/

/* Master View titles */

"MasterViewTitle_Loading" = "Loading...";
"MasterViewTitle_Refreshing" = "Refreshing...";
"MasterViewTitle_Failed" = "Failed";


/* Default Feed title */
"MasterView_FeedNoTitle" = "[No Title]";

/* Detail view "More" button text */
"DetailView_ButtonMore" = "More";

/* Alert */

"AlertViewParsingIncomplete_Title" = "Parsing Incomplete";
"AlertViewParsingIncomplete_CancelButtonTitle" = "Dismiss";
"AlertViewParsingIncomplete_Message" = "There was an error during the parsing of this feed. Not all of the feed items could parsed.";

/* FeedParser */
"Delegate or URL not specified" = "Delegate or URL not specified";
"Asynchronous connection failed to URL: %@" = "Asynchronous connection failed to URL: %@";
"Feed not a valid XML document" = "Feed not a valid XML document";
"Error with feed encoding" = "Error with feed encoding";